; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 5494)
	(= (fuel plane1) 527)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city2)
	(= (capacity plane2) 9309)
	(= (fuel plane2) 535)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at person1 city2)
	(at person2 city2)
	(at person3 city2)
	(at person4 city1)
	(at person5 city0)
	(at person6 city1)
	(at person7 city3)
	(at person8 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 539)
	(= (distance city0 city2) 785)
	(= (distance city0 city3) 721)
	(= (distance city1 city0) 539)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 916)
	(= (distance city1 city3) 719)
	(= (distance city2 city0) 785)
	(= (distance city2 city1) 916)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 614)
	(= (distance city3 city0) 721)
	(= (distance city3 city1) 719)
	(= (distance city3 city2) 614)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city3)
	(at person1 city3)
	(at person2 city1)
	(at person3 city3)
	(at person4 city1)
	(at person5 city2)
	(at person6 city0)
	(at person7 city1)
	(at person8 city0)
	))

(:metric minimize (+ (* 2 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (refuel plane2 city2)
   changed: (fuel plane2) from 535 to 9309
   goals met: 1 of 9
2. (board person1 plane2 city2)
   deleted: (at person1 city2)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 9
3. (board person2 plane2 city2)
   deleted: (at person2 city2)
   added: (in person2 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 9
4. (board person3 plane2 city2)
   deleted: (at person3 city2)
   added: (in person3 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 1 of 9
5. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 0 to 2456, (fuel plane2) from 9309 to 6853
   goals met: 2 of 9
6. (debark person1 plane2 city3)
   deleted: (in person1 plane2)
   added: (at person1 city3)
   changed: (onboard plane2) from 3 to 2
   goals met: 3 of 9
7. (debark person3 plane2 city3)
   deleted: (in person3 plane2)
   added: (at person3 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 9
8. (board person7 plane2 city3)
   deleted: (at person7 city3)
   added: (in person7 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 4 of 9
9. (board person8 plane2 city3)
   deleted: (at person8 city3)
   added: (in person8 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 4 of 9
10. (fly plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 2456 to 5332, (fuel plane2) from 6853 to 3977
   goals met: 3 of 9
11. (debark person2 plane2 city1)
   deleted: (in person2 plane2)
   added: (at person2 city1)
   changed: (onboard plane2) from 3 to 2
   goals met: 4 of 9
12. (debark person7 plane2 city1)
   deleted: (in person7 plane2)
   added: (at person7 city1)
   changed: (onboard plane2) from 2 to 1
   goals met: 5 of 9
13. (board person6 plane2 city1)
   deleted: (at person6 city1)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 5 of 9
14. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 5332 to 7488, (fuel plane2) from 3977 to 1821
   goals met: 5 of 9
15. (debark person6 plane2 city0)
   deleted: (in person6 plane2)
   added: (at person6 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 9
16. (debark person8 plane2 city0)
   deleted: (in person8 plane2)
   added: (at person8 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 9
17. (refuel plane2 city0)
   changed: (fuel plane2) from 1821 to 9309
   goals met: 7 of 9
18. (board person5 plane2 city0)
   deleted: (at person5 city0)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 7 of 9
19. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 7488 to 10628, (fuel plane2) from 9309 to 6169
   goals met: 7 of 9
20. (debark person5 plane2 city2)
   deleted: (in person5 plane2)
   added: (at person5 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 9
21. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 10628 to 13084, (fuel plane2) from 6169 to 3713
   goals met: 9 of 9
